#include "pch.h"
#include "CChurchStage.h"

void CChurchStage::StageTick()
{
	if (bCallRender)
	{
		StageRender();
		bCallRender = false;
	}
}

void CChurchStage::StageInit()
{
}

void CChurchStage::StageRender()
{
	std::cout << "\033[2J\033[H";
	printf("¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à\n");
	BasicRender();
	printf("¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à");
}

void CChurchStage::BasicRender()
{																																						                          
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //2
	printf("¡à               \   |   /                                                                                                -=-                                                                          ¡à\n"); //3
	printf("¡à                 .---.                                                                                              (\\  _  /)                                                                       ¡à\n"); //4
	printf("¡à            '-.  |   |  .-'                                                                                         ( \\( )/ )                                                                       ¡à\n"); //5
	printf("¡à              ___|   |___     :.     --.    .... .    @@ @@@@@                                                      (       )                                                                       ¡à\n"); //6
	printf("¡à         -=  [           ]   -      +.              @@ @@@ * @-                                                      `>   <'                                                                        ¡à\n"); //7
	printf("¡à             `---.   .---'     =          #    .   =@@@@@     @                                                      /     \\                                                                        ¡à\n"); //8
	printf("¡à                 |   |      :    +                   @@+@    @                                                       `-._.-'                                                                        ¡à\n"); //9
	printf("¡à                 |   |       .     =             .   .@   @@@                                                                                                                                       ¡à\n"); //10
	printf("¡à                 |   |        :      =         .    @@    @                                                                                                                                         ¡à\n"); //11
	printf("¡à                 |   |      $  .      ..          @   @=    @;$                                                                                                                                     ¡à\n"); //12
	printf("¡à                 `````          .       -     . #     @ @:    ;@$                                                                                                                                   ¡à\n"); //13
	printf("¡à                             *   .        =   . @*#@. @  :@$  :=#                -=-                           _                                                                                    ¡à\n"); //14
	printf("¡à                                  .             @  @@ @: * .* :@              (\\  _  /)                      (\\o/)                                                                                  ¡à\n"); //14
	printf("¡à                     _      =    .             @ .@ *\=     =                  ( \\( )/ )                       /_\\                                                                                   ¡à\n"); //15
	printf("¡à                   {\\o/}      :     .           -= @@  .@@@@@@@:              (       )                                                                                                             ¡à\n"); //16
	printf("¡à                    /_\\             .          @  @  @@$=     =:@              `>   <'                                                                                                              ¡à\n"); //17
	printf("¡à                               =      :        +- @   *:  +.:--@ =.            /     \\                                                                                                              ¡à\n"); //18
	printf("¡à                                       .       @  @  @#   $ +- .@ =@           `-._.-'                                                                                                              ¡à\n"); //19
	printf("¡à                                #       .      @ @  @=    = * :  @  -                                                                      .,_                                                      ¡à\n"); //20
	printf("¡à                                               @ @  @.    .   @  - \\ @                                                                   (. - `,                                                    ¡à\n"); //21
	printf("¡à                                 *              @ #  *    $ + .@  # # @                           _                                   _.-//-\\ _ )                                                   ¡à\n"); //22
	printf("¡à      <^\\()/^>                                  @ @: @   $  -  @  =  @@                         (\\o/)                                |^-,_.--`|,\\._ __                                              ¡à\n"); //23
	printf("¡à       \\/  \\/                      =             @@  @   =   @ @  -                              /_\\                                 ||\\_.-`| |_/ /'  `\\                                            ¡à\n"); //24
	printf("¡à        /  \\                                         @ @   @ --  #                                                                   | \\ ,-`  |        \\                                            ¡à\n"); //25
	printf("¡à        `''`                                   .    #.*   * -@  @.                                                                   | ||     |  `-.__/`.                                           ¡à\n"); //26
	printf("¡à                                   :           .    .@   @  @   =$                                                                    \\||_. - r`     /    `-._                                      ¡à\n"); //27
	printf("¡à                                                    @@ @   @#  *.@                                                                          `-/'    /         `-.                                   ¡à\n"); //28
	printf("¡à                                    +              @ .    @@  @:==                                                                  _______,-/_   /'             \\                                  ¡à\n"); //29
	printf("¡à              _          (`-.                    $ $    @ *  *  @:           .-')          _                                   --'`|       |`  ),' `---.  ,       |                                 ¡à\n"); //30
	printf("¡à              \\`----.    ) ^_`)       +          @=*   @  @  @$ * *        (`_^ (    .----`/                                  \\..-`--..___|_,/          /       /                                   ¡à\n"); //31
	printf("¡à       ,__     \\__   `\\_/  ( `                @$ -  @.  @  @$  * =          ` )  \\_/`   __/     __,                                    |    |`,-,...,/      ,'                                      ¡à\n"); //32
	printf("¡à        \\_\\      \\__  `|   }        :      @+ @ @   @  @* $ @ @             __{   |`  __/      /_/                                     \\    |       /     ,' __  r-'',                              ¡à\n"); //33
	printf("¡à          \\\\  .--' \\__/    }               @ .@    #  @.@.- +: @           / _{    \\__/ '--.  //                                       |___|/     /  __ /-''  `'`)  |                               ¡à\n"); //34
	printf("¡à           ))/   \\__,<  /_/             $.@=   +@**@ *+ +  + $             \\_> \\_\\  >__/    \\((                                    _,-'    |    /,-' /     _,.--|  (                                ¡à\n"); //35
	printf("¡à           ((|  _/_/ `\\ \\_\\_   .    .@@@@.  .@@@     $=+  $@@*                  _/ /` _\\_   |))                                  .-'       )   `(_   / _,.-'  ,-' _,/                               ¡à\n"); //36
	printf("¡à            `\\_____\\\\  )__\\_\\     .+#-. ==#@. $    @@-   @@    @-              /__(  /______/`                                   `-------'       `--''       `'''                                   ¡à\n"); //37
	printf("¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à\n"); //38
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //39
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //40
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //41
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //42
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //43
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //44
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //45
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //46
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //47
	printf("¡à                                                                                                                                                                                                    ¡à\n"); //48
}

